import sys
from datetime import date
from urllib.request import urlopen
import newspaper
from NewsSpider import crawler_main
from NewsSpider.spider import Spider

parties_vocab = {
    'ליכוד': ['ליכוד', 'נתניהו', 'מירי רגב', 'ישראל כץ', 'גלעד ארדן', 'יולי אדלשטיין', 'יואב גלנט', 'יריב לוין',
              'גדעון סער'],
    'הימין החדש': ['הימין החדש', 'בנט', 'איילת שקד', 'אלונה ברקת', 'שולי מועלם'],
    'זהות': ['מפלגת זהות', 'משה פייגלין', 'חיים אמסלם', 'גדי וילצ\'רסקי', 'גלעד אלפר'],
    'ישראל ביתנו': ['ישראל ביתנו', 'ליברמן', 'עודד פורר', 'יבגני סובה', 'אלי אבידר'],
    'כולנו': ['מפלגת כולנו', 'כחלון', 'אלי כהן', 'יפעת שאשא ביטון', 'מירב בן ארי', 'רועי פולקמן'],
    'חדש תעל': ['חד"ש', 'תע"ל', 'אימן עודה', 'אחמד טיבי', 'עאידה תומא סלימאן'],
    'רעם בלד': ['רע"ם', 'בל"ד', 'רע"מ', 'עבאס מנסור', 'שחאדה אנטאנס'],
    'גשר': ['מפלגת גשר', 'אורלי לוי', ' גלעד סממה', 'דדי פרלמוטר'],
    'איחוד הימין': ['איחוד מפלגות הימין', 'איחוד הימין', 'סמוטריץ', 'הבית היהודי', 'איתמר בן גביר', ' רפי פרץ'],
    'כחול לבן': ['מפלגת יש עתיד', 'חוסן לישראל', 'מפלגת כחול לבן', 'יאיר לפיד', 'גנץ', 'גבי אשכנזי', 'בוגי יעלון'],
    'עבודה': ['אבי גבאי', 'איציק שמולי', 'מפלגת העבודה', 'טל רוסו', 'סתיו שפיר', 'עמיר פרץ', 'שלי יחימוביץ',
              'איתן כבל'],
    'שס': ["אריה דרעי", 'ש"ס', 'יצחק כהן', 'משולם נהרי', "יעקוב מרגי", 'יעקב מרגי'],
    'יהדות התורה': ["יהדות התורה", 'יעקב ליצמן', "יעקוב ליצמן", 'משה גפני', 'מאיר פריש', 'אורי מקלב'],
    'מרצ': ["מרצ ", "תמר זנדברג", 'מפלגת מרצ', "אילן גילאון", "מיכל רוזין", "עיסאווי פריג", "עלי סלאלחה",
            "מירב מיכאלי"]}

url = 'https://www.ynet.co.il/home/0,7340,L-2,00.html'
# published_from the announcement of elections
# published_until the massive rocket attack
crawler_main.Crawler("ynet", url, 16, parties_vocab, published_from=date(18, 12, 1), published_until=date(19, 5, 4))
