import sys
from datetime import date
from urllib.request import urlopen
import newspaper
from NewsSpider import crawler_main
from NewsSpider.spider import Spider

# page_url = "https://www.ynet.co.il/articles/0,7340,L-5500186,00.html#autoplay"
# Spider.save_article(page_url)

parties_vocab = {
    'ליכוד': ['ליכוד', 'נתניהו', 'מירי רגב', 'ישראל כץ', 'גלעד ארדן', 'יולי אדלשטיין', 'גדעון סער'],
    'הימין החדש': ['הימין החדש', 'בנט', 'איילת שקד', 'אלונה ברקת', 'שולי מועלם'],
    'זהות': ['זהות', 'משה פייגלין', 'חיים אמסלם', 'גדי וילצ\'רסקי', 'גלעד אלפר'],
    'ישראל ביתנו': ['ישראל ביתנו', 'ליברמן', 'עודד פורר', 'יבגני סובה', 'אלי אבידר'],
    'כולנו': ['מפלגת כולנו', 'כחלון', 'אלי כהן', 'יפעת שאשא ביטון', 'מירב בן ארי', 'רועי פולקמן'],
    'חדש תעל': ['חד"ש', 'תע"ל', 'אימן עודה', 'אחמד טיבי', 'עאידה תומא סלימאן'],
    'רעם בלד': ['רע"ם', 'בל"ד', 'רע"מ', 'עבאס מנסור', 'שחאדה אנטאנס'],
    'גשר': ['מפלגת גשר', 'אורלי לוי', ' גלעד סממה', 'דדי פרלמוטר'],
    'איחוד הימין': ['איחוד מפלגות הימין', 'איחוד הימין', 'סמוטריץ', 'איתמר בן גביר', ' רפי פרץ'],
    'כחול לבן': ['כחול לבן', 'יאיר לפיד', 'גנץ', 'גבי אשכנזי', 'בוגי יעלון'],
    'עבודה': ['אבי גבאי', 'איציק שמולי', 'מפלגת העבודה', 'טל רוסו', 'סתיו שפיר', 'עמיר פרץ', 'שלי יחימוביץ',
              'איתן כבל'],
    'שס': ["אריה דרעי", 'ש"ס', 'יצחק כהן', 'משולם נהרי', "יעקוב מרגי", 'יעקב מרגי'],
    'יהדות התורה': ["יהדות התורה", 'יעקב ליצמן', "יעקוב ליצמן", 'משה גפני', 'מאיר פריש', 'אורי מקלב'],
    'מרצ': ["מרצ ","תמר זנדברג", "אילן גילאון", "מיכל רוזין", "עיסאווי פריג", "עלי סלאלחה"]}

url = 'https://www.ynet.co.il/home/0,7340,L-2,00.html'
crawler_main.Crawler("ynet", url, 16, parties_vocab, date(18, 12, 1))
# sys.setrecursionlimit(1500)
# url = 'http://www.ynet.co.il/tags/נפתלי_בנט/'
# encode('ascii', 'ignore').decode('ascii')
# print(url)
# urlopen(url)
